robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
/*
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * Copyright (c) 1998-2003 Apple Computer, Inc.  All Rights Reserved.
 * 
 * This file contains Original Code and/or Modifications of Original Code
 * as defined in and that are subject to the Apple Public Source License
 * Version 2.0 (the 'License'). You may not use this file except in
 * compliance with the License. Please obtain a copy of the License at
 * http://www.opensource.apple.com/apsl/ and read it before using this
 * file.
 * 
 * The Original Code and all software distributed under the License are
 * distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
 * Please see the License for the specific language governing rights and
 * limitations under the License.
 * 
 * @APPLE_LICENSE_HEADER_END@
 */

    /* MSP430LPCDC.cpp - MacOSX implementation based on Apple's CDC/ACM of	*/
    /* Launch Pad USB Communication Device Class (CDC) Driver, ACM Data Interface.	*/

#include <machine/limits.h>			/* UINT_MAX */
#include <libkern/OSByteOrder.h>

#include <IOKit/assert.h>
#include <IOKit/IOLib.h>
#include <IOKit/IOService.h>
#include <IOKit/IOBufferMemoryDescriptor.h>
#include <IOKit/IOMessage.h>

#include <IOKit/pwr_mgt/RootDomain.h>

#include <IOKit/usb/IOUSBBus.h>
#include <IOKit/usb/IOUSBNub.h>
#include <IOKit/usb/IOUSBDevice.h>
#include <IOKit/usb/IOUSBLog.h>
#include <IOKit/usb/IOUSBPipe.h>
#include <IOKit/usb/USB.h>
#include <IOKit/usb/IOUSBInterface.h>

#include <IOKit/serial/IOSerialKeys.h>
#include <IOKit/serial/IOSerialDriverSync.h>
#include <IOKit/serial/IOModemSerialStreamSync.h>
#include <IOKit/serial/IORS232SerialStreamSync.h>

#include <UserNotification/KUNCUserNotifications.h>

#define DEBUG_NAME "MSP430LPCDC"
#define drvver "1.0.3b"
#include "AppleUSBCDCACM.h"
#include "MSP430LPCDC.h"

#define MIN_BAUD (50 << 1)

//MSP430LPCDC		*gControlDriver = NULL;			// Our Control driver

static const OSSymbol *gPMWakeOnRingSymbol = NULL;

static IOPMPowerState gOurPowerStates[kNumCDCStates] =
{
    {1,0,0,0,0,0,0,0,0,0,0,0},
    {1,IOPMDeviceUsable,IOPMPowerOn,IOPMPowerOn,0,0,0,0,0,0,0,0}
};

#define super IOSerialDriverSync

OSDefineMetaClassAndStructors(MSP430LPCDC, IOSerialDriverSync);


// Encode the 4 modem status bits (so we only make one call to setState)

#if 0
static UInt32 sMapModemStates[16] = 
{
    0 |              0 |              0 |              0, // 0000
    0 |              0 |              0 | PD_RS232_S_DCD, // 0001
    0 |              0 | PD_RS232_S_DSR |              0, // 0010
    0 |              0 | PD_RS232_S_DSR | PD_RS232_S_DCD, // 0011
    0 | PD_RS232_S_BRK |              0 |              0, // 0100
    0 | PD_RS232_S_BRK |              0 | PD_RS232_S_DCD, // 0101
    0 | PD_RS232_S_BRK | PD_RS232_S_DSR |              0, // 0110
    0 | PD_RS232_S_BRK | PD_RS232_S_DSR | PD_RS232_S_DCD, // 0111
	PD_RS232_S_RNG |              0 |              0 |              0, // 1000
	PD_RS232_S_RNG |              0 |              0 | PD_RS232_S_DCD, // 1001
	PD_RS232_S_RNG |              0 | PD_RS232_S_DSR |              0, // 1010
	PD_RS232_S_RNG |              0 | PD_RS232_S_DSR | PD_RS232_S_DCD, // 1011
	PD_RS232_S_RNG | PD_RS232_S_BRK |              0 |              0, // 1100
	PD_RS232_S_RNG | PD_RS232_S_BRK |              0 | PD_RS232_S_DCD, // 1101
	PD_RS232_S_RNG | PD_RS232_S_BRK | PD_RS232_S_DSR |              0, // 1110
	PD_RS232_S_RNG | PD_RS232_S_BRK | PD_RS232_S_DSR | PD_RS232_S_DCD, // 1111
};
#endif


/****************************************************************************************************/
//
//		Function:	findControlDriverAD
//
//		Inputs:		me - my address
//
//		Outputs:	MSP430LPCDC
//
//		Desc:		Finds our matching control driver
//
/****************************************************************************************************/

// Think can delete as now both are the same driver.

MSP430LPCDC *findControlDriverAD(void *me)
{
    Boolean      worked             = false;
    MSP430LPCDC	*tempDriver         = (MSP430LPCDC*)me;    
    XTRACE(me, 0, 0, "findControlDriverAD");
    worked = true;
	return tempDriver;
	
}
/* end findControlDriverAD */


#if LOG_DATA
#define dumplen		32		// Set this to the number of bytes to dump and the rest should work out correct

#define buflen		((dumplen*2)+dumplen)+3
#define Asciistart	(dumplen*2)+3

/****************************************************************************************************/
//
//		Function:	USBLogData
//
//		Inputs:		Dir - direction
//				Count - number of bytes
//				buf - the data
//
//		Outputs:	
//
//		Desc:		Puts the data in the log. 
//
/****************************************************************************************************/

void MSP430LPCDC::USBLogData(UInt8 Dir, SInt32 Count, char *buf)
{    
    SInt32	wlen;
    SInt32	llen, rlen;
    SInt16	i, Aspnt, Hxpnt;
    UInt8	wchr;
    UInt8	LocBuf[buflen+1];
    
    switch (Dir)
    {
        case kDataIn:
            Log( "MSP430LPCDC: USBLogData - Read Complete, address = %8p, size = %8d\n", (void *)buf, (UInt)Count );
            break;
        case kDataOut:
            Log( "MSP430LPCDC: USBLogData - Write, address = %8p, size = %8d\n", (void *)buf, (UInt)Count );
            break;
        case kDataOther:
            Log( "MSP430LPCDC: USBLogData - Other, address = %8p, size = %8d\n", (void *)buf, (UInt)Count );
            break;
    }

    if (Count > dumplen)
    {
        wlen = dumplen;
    } else {
        wlen = Count;
    }

    if (wlen == 0)
    {
        Log( "MSP430LPCDC: USBLogData - No data, Count=0\n" );
        return;
    }

    rlen = 0;
    do
    {
		memset(LocBuf, 0x20, buflen);
        
        if (wlen > dumplen)
        {
            llen = dumplen;
            wlen -= dumplen;
        } else {
            llen = wlen;
            wlen = 0;
        }
        Aspnt = Asciistart;
        Hxpnt = 0;
        for (i=1; i<=llen; i++)
        {
            wchr = buf[i-1];
            LocBuf[Hxpnt++] = Asciify(wchr >> 4);
            LocBuf[Hxpnt++] = Asciify(wchr);
            if ((wchr < 0x20) || (wchr > 0x7F)) 		// Non printable characters
            {
                LocBuf[Aspnt++] = 0x2E;				// Replace with a period
            } else {
                LocBuf[Aspnt++] = wchr;
            }
        }
        LocBuf[Aspnt] = 0x00;

