robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
size_t MSP430LPCDC::RemovefromQueue(CirQueue *Queue, UInt8 *Buffer, size_t MaxSize)
{
    size_t	BytesReceived = 0;
    UInt8	Value;

    //  while((GetBytetoQueue(Queue, &Value) == queueNoError) && (MaxSize >= BytesReceived))
    while((MaxSize > BytesReceived) && (GetBytetoQueue(Queue, &Value) == queueNoError)) 
    {
        *Buffer++ = Value;
        BytesReceived++;
    }/* end while */

    return BytesReceived;
	
}/* end RemovefromQueue */

/****************************************************************************************************/
//
//		Method:		FreeSpaceinQueue
//
//		Inputs:		Queue - the queue to be queried
//
//		Outputs:	Return Value - Free space left
//
//		Desc:		Return the amount of free space left in this buffer.
//
/****************************************************************************************************/

size_t MSP430LPCDC::FreeSpaceinQueue(CirQueue *Queue)
{
    size_t	retVal = 0;
    
    retVal = Queue->Size - Queue->InQueue;

    return retVal;
	
}/* end FreeSpaceinQueue */

/****************************************************************************************************/
//
//		Method:		UsedSpaceinQueue
//
//		Inputs:		Queue - the queue to be queried
//
//		Outputs:	UsedSpace - Amount of data in buffer
//
//		Desc:		Return the amount of data in this buffer.
//
/****************************************************************************************************/

size_t MSP430LPCDC::UsedSpaceinQueue(CirQueue *Queue)
{
    return Queue->InQueue;
	
}/* end UsedSpaceinQueue */

/****************************************************************************************************/
//
//		Method:		GetQueueSize
//
//		Inputs:		Queue - the queue to be queried
//
//		Outputs:	QueueSize - The size of the queue.
//
//		Desc:		Return the total size of the queue.
//
/****************************************************************************************************/

size_t MSP430LPCDC::GetQueueSize(CirQueue *Queue)
{
    return Queue->Size;
	
}/* end GetQueueSize */

/****************************************************************************************************/
//
//		Method:		GetQueueStatus
//
//		Inputs:		Queue - the queue to be queried
//
//		Outputs:	Queue status - full, empty or no error
//
//		Desc:		Returns the status of the circular queue.
//
/****************************************************************************************************/

QueueStatus MSP430LPCDC::GetQueueStatus(CirQueue *Queue)
{
    if ((Queue->NextChar == Queue->LastChar) && Queue->InQueue)
        return queueFull;
    else if ((Queue->NextChar == Queue->LastChar) && !Queue->InQueue)
        return queueEmpty;
		
    return queueNoError ;
	
}/* end GetQueueStatus */

/****************************************************************************************************/
//
//		Method:		CheckQueues
//
//		Inputs:		
//
//		Outputs:	
//
//		Desc:		Checks the various queue's etc and manipulates the state(s) accordingly
//				Must be called from a gated method or completion routine.
//
/****************************************************************************************************/

void MSP430LPCDC::CheckQueues()
{
    UInt32	Used;
    UInt32	Free;
    UInt32	QueuingState;
    UInt32	DeltaState;

	// Initialise the QueueState with the current state.
        
    QueuingState = fPort.State;

        // Check to see if there is anything in the Transmit buffer.
        
    Used = UsedSpaceinQueue(&fPort.TX);
    Free = FreeSpaceinQueue(&fPort.TX);
    
    XTRACE(this, Free, Used, "CheckQueues");
    
    if (Free == 0)
    {
        QueuingState |=  PD_S_TXQ_FULL;
        QueuingState &= ~PD_S_TXQ_EMPTY;
    } else {
        if (Used == 0)
	{
            QueuingState &= ~PD_S_TXQ_FULL;
            QueuingState |=  PD_S_TXQ_EMPTY;
        } else {
            QueuingState &= ~PD_S_TXQ_FULL;
            QueuingState &= ~PD_S_TXQ_EMPTY;
        }
    }

    	// Check to see if we are below the low water mark.
        
    if (Used < fPort.TXStats.LowWater)
         QueuingState |=  PD_S_TXQ_LOW_WATER;
    else QueuingState &= ~PD_S_TXQ_LOW_WATER;

    if (Used > fPort.TXStats.HighWater)
         QueuingState |= PD_S_TXQ_HIGH_WATER;
    else QueuingState &= ~PD_S_TXQ_HIGH_WATER;


        // Check to see if there is anything in the Receive buffer.
        
    Used = UsedSpaceinQueue(&fPort.RX);
    Free = FreeSpaceinQueue(&fPort.RX);

    if (Free == 0)
    {
        QueuingState |= PD_S_RXQ_FULL;
        QueuingState &= ~PD_S_RXQ_EMPTY;
    } else {
        if (Used == 0)
	{
            QueuingState &= ~PD_S_RXQ_FULL;
            QueuingState |= PD_S_RXQ_EMPTY;
        } else {
            QueuingState &= ~PD_S_RXQ_FULL;
            QueuingState &= ~PD_S_RXQ_EMPTY;
        }
    }

        // Check to see if we are below the low water mark.
    
    if (Used < fPort.RXStats.LowWater)
         QueuingState |= PD_S_RXQ_LOW_WATER;
    else QueuingState &= ~PD_S_RXQ_LOW_WATER;

    if (Used > fPort.RXStats.HighWater)
         QueuingState |= PD_S_RXQ_HIGH_WATER;
    else QueuingState &= ~PD_S_RXQ_HIGH_WATER;

        // Figure out what has changed to get mask.
        
    DeltaState = QueuingState ^ fPort.State;
    setStateGated(&QueuingState, &DeltaState);
	
}/* end CheckQueues */

/****************************************************************************************************/
//
//		Method:		CheckHold
//
//		Inputs:		
//
//		Outputs:	
//
//		Desc:		Checks to see if there's any held buffers
//
/****************************************************************************************************/

void MSP430LPCDC::CheckHold()
{
	SInt32			size;
	inPipeBuffers	*buffs;
	IOReturn		ior = kIOReturnSuccess;
	
	XTRACE(this, fPort.holdQueueIndxIn, fPort.holdQueueIndxOut, "CheckHold");
	
	while (1)
	{
		if (fPort.holdQueue[fPort.holdQueueIndxOut] != 0)
		{
			buffs = fPort.holdQueue[fPort.holdQueueIndxOut];
			size = AddtoRXQueue(&fPort.RX, buffs, buffs->count);
			if (size == 0)
			{
				XTRACE(this, fPort.holdQueueIndxIn, fPort.holdQueueIndxOut, "CheckHold - Still holding");
				break;
			} else {
				buffs->count = 0;
				buffs->held = false;
				XTRACE(this, fPort.holdQueueIndxIn, fPort.holdQueueIndxOut, "CheckHold - Read issued");
				ior = fPort.InPipe->Read(buffs->pipeMDP, &buffs->completionInfo, NULL);
				if (ior != kIOReturnSuccess)
				{
					XTRACE(this, fPort.holdQueueIndxOut, ior, "CheckHold - Read io err");
					buffs->dead = true;
				}
				fPort.holdQueue[fPort.holdQueueIndxOut] = 0;
				fPort.holdQueueIndxOut++;
				if (fPort.holdQueueIndxOut >= kMaxInBufPool)
				{
					fPort.holdQueueIndxOut = 0;
				}
			}
		} else {
			break;
		}
	}
	
	CheckQueues();
	
	XTRACE(this, fPort.holdQueueIndxIn, fPort.holdQueueIndxOut, "CheckHold - Exit");
	
}/* end CheckHold */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::dataReadComplete
//
//		Inputs:		obj - me
//				param - the buffer pool pointer
//				rc - return code
//				remaining - what's left
//
//		Outputs:	None
//
//		Desc:		BulkIn pipe read completion routine
//
/****************************************************************************************************/

void MSP430LPCDC::dataReadComplete(void *obj, void *param, IOReturn rc, UInt32 remaining)
{
    MSP430LPCDC	*me = (MSP430LPCDC*)obj;
    inPipeBuffers		*buffs = (inPipeBuffers *)param;
    IOReturn		ior;
    size_t			length;
	SInt32			putInQueue = 0;
    
    XTRACE(me, rc, 0, "dataReadComplete");
    
    if (me->fStopping)
        return;

    if (rc == kIOReturnSuccess)				// If operation returned ok
    {
        length = DATA_BUFF_SIZE - remaining;
        XTRACE(me, me->fPort.State, length, "dataReadComplete - data length");
		
		if (length > 0)
		{
			meLogData(kDataIn, length, buffs->pipeBuffer);
	
				// Move the incoming bytes to the ring buffer, if we can
            
//			me->AddtoQueue(&me->fPort.RX, buffs->pipeBuffer, length);
		
				// If the indices are not equal then there's something in the hold queue
		
			if (me->fPort.holdQueueIndxIn != me->fPort.holdQueueIndxOut)
			{
				putInQueue = 0;
			} else {
				putInQueue = me->AddtoRXQueue(&me->fPort.RX, buffs, length);
			}
			if (putInQueue == 0)
			{
				XTRACE(me, 0, me->fPort.holdQueueIndxIn, "dataReadComplete - Buffer held");
				buffs->held = true;
				buffs->count = length;
				me->fPort.holdQueue[me->fPort.holdQueueIndxIn++] = buffs;
				if (me->fPort.holdQueueIndxIn >= kMaxInBufPool)
				{
					me->fPort.holdQueueIndxIn = 0;
				}
			}
		}
    } else {
        XTRACE(me, 0, rc, "dataReadComplete - error");
		if (rc != kIOReturnAborted)
        {
			if (rc == kIOUSBPipeStalled)
			{
				rc = me->checkPipe(me->fPort.InPipe, true);
			} else {
				rc = me->checkPipe(me->fPort.InPipe, false);
			}
            if (rc != kIOReturnSuccess)
            {
                XTRACE(me, 0, rc, "dataReadComplete - clear stall failed (trying to continue)");
            }
        }
    }
    
        // Queue the read only if not aborted and the buffer is not held
	
    if (rc != kIOReturnAborted)
    {
		if (!buffs->held)
		{
			XTRACE(me, 0, me->fPort.holdQueueIndxIn, "dataReadComplete - Read issued");
			ior = me->fPort.InPipe->Read(buffs->pipeMDP, &buffs->completionInfo, NULL);
			if (ior != kIOReturnSuccess)
			{
				XTRACEP(me, buffs, ior, "dataReadComplete - Read io err");
				buffs->dead = true;
			} else {
				XTRACEP(me, buffs, me->fPort.InPipe, "dataReadComplete - Read posted");
			}
		}
        me->CheckQueues();
	} else {
		XTRACEP(me, buffs, me->fPort.InPipe, "dataReadComplete - Read aborted");
	}
	
}/* end dataReadComplete */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::dataWriteComplete
//
//		Inputs:		obj - me
//				param - the buffer pool pointer
//				rc - return code
//				remaining - what's left
//
//		Outputs:	None
//
//		Desc:		BulkOut pipe write completion routine
//
/****************************************************************************************************/

void MSP430LPCDC::dataWriteComplete(void *obj, void *param, IOReturn rc, UInt32 remaining)
{
    MSP430LPCDC	*me = (MSP430LPCDC *)obj;
    outPipeBuffers		*buffs = (outPipeBuffers *)param;
    SInt32		dLen;
    UInt16		i;
    bool		busy = false;
	UInt32		state;
	UInt32		mask;
    
    XTRACE(me, rc, 0, "dataWriteComplete");
    
    if (me->fStopping)
        return;

    if (rc == kIOReturnSuccess)
    {	
        dLen = buffs->count - remaining;
        XTRACE(me, 0, dLen, "dataWriteComplete - data length");
        if (dLen > 0)						// Check if it was a zero length write
        {
            if ((dLen % me->fPort.OutPacketSize) == 0)		// If it was a multiple of max packet size then we need to do a zero length write
            {
                XTRACE(me, rc, dLen, "dataWriteComplete - writing zero length packet");
                buffs->count = 0;
                buffs->pipeMDP->setLength(0);
                
                me->fPort.OutPipe->Write(buffs->pipeMDP, &buffs->completionInfo);
                return;
            } else {
                buffs->avail = true;
            }
        } else {
            buffs->avail = true;
        }

        me->CheckQueues();
        
