robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
            // If any of the buffers are unavailable then we're still busy

        for (i=0; i<me->fOutBufPool; i++)
        {
            if (!me->fPort.outPool[i].avail)
            {
                busy = true;
                break;
            }
        }

        if (!busy)
        {
			state = 0;
			mask = PD_S_TX_BUSY;
            me->setStateGated(&state, &mask);	// Clear the busy state
        }

        me->setUpTransmit();						// just to keep it going??

    } else {
        XTRACE(me, 0, rc, "dataWriteComplete - io error");
		if (rc != kIOReturnAborted)
        {
			if (rc == kIOUSBPipeStalled)
			{
				rc = me->checkPipe(me->fPort.InPipe, true);
			} else {
				rc = me->checkPipe(me->fPort.InPipe, false);
			}
            if (rc != kIOReturnSuccess)
            {
                XTRACE(me, 0, rc, "dataWriteComplete - clear stall failed (trying to continue)");
            }
        }

        
        buffs->avail = true;
        
             // If any of the buffers are unavailable then we're still busy

        for (i=0; i<me->fOutBufPool; i++)
        {
            if (!me->fPort.outPool[i].avail)
            {
                busy = true;
                break;
            }
        }

        if (!busy)
        {
			state = 0;
			mask = PD_S_TX_BUSY;
            me->setStateGated(&state, &mask);
        }
    }
	
}/* end dataWriteComplete */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::probe
//
//		Inputs:		provider - my provider
//
//		Outputs:	IOService - from super::probe, score - probe score
//
//		Desc:		Modify the probe score if necessary (we don't  at the moment)
//
/****************************************************************************************************/

IOService* MSP430LPCDC::probe( IOService *provider, SInt32 *score )
{ 
    IOService   *res;
    
    XTRACE(this,0,0, "Probing");
    
    fMSP430Interface = OSDynamicCast(IOUSBInterface, provider);
    if(!fMSP430Interface)
    {
        ALERT(0, 0, "start - provider invalid");
        return 0;
    }
    
    fProductID = fMSP430Interface->GetDevice()->GetProductID();
    fVendorID = fMSP430Interface->GetDevice()->GetVendorID();
 
   if ((fVendorID != 0x0451) || (fProductID != 0xf432)) {
        IOLog("%s : CDC /ACM found but not Launchpad / eZ430-RF2500\n",getName());
        return 0;
    }

    res = super::probe(provider, score);
    
    return res;
    
}/* end probe */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::start
//
//		Inputs:		provider - my provider
//
//		Outputs:	Return code - true (it's me), false (sorry it probably was me, but I can't configure it)
//
//		Desc:		This is called once it has been determined I'm probably the best 
//				driver for this device.
//
/****************************************************************************************************/

bool MSP430LPCDC::start(IOService *provider)
{

    OSNumber	*bufNumber = NULL;
    UInt16		bufValue = 0;
	IOUSBDevice *usbDevice;
    int err;
    char devicename[0x40] = "";
    char deviceserialno[0x22] = "";
	
	XTRACE(this, 0, 0, "start");
    
    fSessions = 0;
    fTerminate = false;
	fSuppressWarning = false;
	fEnumOnWake = false;
    fStopping = false;
	fCDCDriver = NULL;
	fControlDriver = NULL;
	fWorkLoop = NULL;
	fPMRootDomain = NULL;
	fWoR = false;
	fWakeSettingControllerHandle = NULL;
	fWanDevice = kOSBooleanFalse;
    fThreadSleepCount = 0;
    fReady = false;
    
    initStructure();
    
    if(!super::start(provider))
    {
        ALERT(0, 0, "start - super failed");
        return false;
    }

	// Get my USB provider - the interface

    fMSP430Interface = OSDynamicCast(IOUSBInterface, provider);
    if(!fMSP430Interface)
    {
        ALERT(0, 0, "start - provider invalid");
        return false;
    }

    IOLog("----------------------------------------------------\n");
    IOLog("Texas Instrument LaunchPad / EZ430-RF2500 CDC/ACM Driver\n");
    IOLog("           Version %s - Terence Ang 2011 \n", drvver);
    IOLog("----------------------------------------------------\n");
    
    usbDevice = OSDynamicCast (IOUSBDevice, fMSP430Interface->GetDevice());
    
    err = usbDevice->GetStringDescriptor(usbDevice->GetProductStringIndex(), devicename, 0x40 , 0x409);
    err = usbDevice->GetStringDescriptor(usbDevice->GetSerialNumberStringIndex(), deviceserialno, 0x22 , 0x409);
    
    if(err){
        ALERT(0, 0, "Probing - Error Getting Device name and Serial no.");
        return NULL;
    }
    
    IOLog("%s : Device Name = %s\n", getName() , devicename);
    IOLog("%s : Serial Number = %s\n", getName(), deviceserialno);
    
    IOLog("----------------------------------------------------\n");
    

    fPort.DataInterfaceNumber = fMSP430Interface->GetInterfaceNumber();
    
      // get workloop
        
    fWorkLoop = getWorkLoop();
    if (!fWorkLoop)
    {
        ALERT(0, 0, "start - getWorkLoop failed");
        return false;
    }
    
    fCommandGate = IOCommandGate::commandGate(this);
    if (!fCommandGate)
    {
        ALERT(0, 0, "start - commandGate failed");
        return false;
    }
    
    if (fWorkLoop->addEventSource(fCommandGate) != kIOReturnSuccess)
    {
        ALERT(0, 0, "start - addEventSource(commandGate) failed");
        return false;
    }
	
		// Check for an input buffer pool override first
	
	fInBufPool = 0;
	fOutBufPool = 0;
		
	bufNumber = (OSNumber *)provider->getProperty(inputTag);
    if (bufNumber)
    {
		bufValue = bufNumber->unsigned16BitValue();
		XTRACE(this, 0, bufValue, "start - Number of input buffers override value");
        if (bufValue <= kMaxInBufPool)
        {
            fInBufPool = bufValue;
        } else {
            fInBufPool = kMaxInBufPool;
        }
	} else {
		fInBufPool = 0;
	}
    
		// Now set up the real input buffer pool values (only if not overridden)
    
	if (fInBufPool == 0)
	{
		bufNumber = NULL;
		bufNumber = (OSNumber *)getProperty(inputTag);
		if (bufNumber)
		{
			bufValue = bufNumber->unsigned16BitValue();
			XTRACE(this, 0, bufValue, "start - Number of input buffers requested");
			if (bufValue <= kMaxInBufPool)
			{
				fInBufPool = bufValue;
			} else {
				fInBufPool = kMaxInBufPool;
			}
		} else {
			fInBufPool = kInBufPool;
		}
    }
	
		// Check for an output buffer pool override
		
	bufNumber = NULL;
	bufNumber = (OSNumber *)provider->getProperty(outputTag);
    if (bufNumber)
    {
		bufValue = bufNumber->unsigned16BitValue();
		XTRACE(this, 0, bufValue, "start - Number of output buffers override value");
        if (bufValue <= kMaxOutBufPool)
        {
            fOutBufPool = bufValue;
        } else {
            fOutBufPool = kMaxOutBufPool;
        }
	} else {
		fOutBufPool = 0;
	}
    
        // Now set up the real output buffer pool values (only if not overridden)
    
	if (fOutBufPool == 0)
	{
		bufNumber = NULL;
		bufNumber = (OSNumber *)getProperty(outputTag);
		if (bufNumber)
		{
			bufValue = bufNumber->unsigned16BitValue();
			XTRACE(this, 0, bufValue, "start - Number of output buffers requested");
			if (bufValue <= kMaxOutBufPool)
			{
				fOutBufPool = bufValue;
			} else {
				fOutBufPool = kMaxOutBufPool;
			}
		} else {
			fOutBufPool = kOutBufPool;
		}
	}
    
    XTRACE(this, fInBufPool, fOutBufPool, "start - Buffer pools (input, output)");
	
		// Check Reset on Close
	
	OSBoolean *boolObj = OSDynamicCast(OSBoolean, provider->getProperty("ResetOnClose"));
    if (boolObj && boolObj->isTrue())
    {
		fResetOnClose = TRUE;
        XTRACE(this, 0, 0, "start - Reset on close is on");
    } else {
		fResetOnClose = FALSE;
	}
	
