robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
		// Check Suppress Warning
	
	OSBoolean *boolObj1 = OSDynamicCast(OSBoolean, provider->getProperty("SuppressWarning"));
    if (boolObj1 && boolObj1->isTrue())
    {
		fSuppressWarning = TRUE;
        XTRACE(this, 0, 0, "start - Suppress Warning is on");
    } else {
		fSuppressWarning = FALSE;
	}
	
		// Check Enumerate on wake
	
	OSBoolean *boolObj2 = OSDynamicCast(OSBoolean, provider->getProperty("EnumerateOnWake"));
    if (boolObj2 && boolObj2->isTrue())
    {
		fEnumOnWake = TRUE;
        XTRACE(this, 0, 0, "start - Enumerate on wake is on");
    } else {
		fEnumOnWake = FALSE;
	}
	
    if (!createSerialStream())					// Publish SerialStream services
    {
        ALERT(0, 0, "start - createSerialStream failed");
        return false;
    }
    
    if (!allocateDataResources()) 
    {
        ALERT(0, 0, "start - allocateCommResources data failed");
        releaseResources();
        return false;
    }
            
        // Looks like we're ok
    
    fMSP430Interface->retain();
    fWorkLoop->retain();
    fCommandGate->enable();

	gPMWakeOnRingSymbol = OSSymbol::withCString(kIOPMSettingWakeOnRingKey);
	
	if (fConfigAttributes & kUSBAtrRemoteWakeup)
    {
		XTRACE(this, 0, 0, "start - Remote wake up is supported");
		WakeonRing();
		setWakeFeature();
		if (!setupWakeOnRingPMCallback())
		{
			XTRACE(this, 0, 0, "start - Setting the Wake on Ring callback failed");
		}
	} else {
        XTRACE(this, 0, 0, "start - Remote wake up not supported");
    }
	
		// Save the ID's
    
    fVendorID = fMSP430Interface->GetDevice()->GetVendorID();
    fProductID = fMSP430Interface->GetDevice()->GetProductID();
    
    fReady = true;
    
    if (!getFunctionalDescriptors())
    {
        ALERT(0, 0, "start - configureACM failed");
        releaseResources();
        return false;
    }
    
    if (!allocateCommResources()) 
    {
		fMSP430Interface = NULL; //rs Since we did not retain it as yet.
        ALERT(0, 0, "start - allocateCommResources failed");
		releaseResources();
        return false;
    }

    
    if (!initForPM(provider))
    {
        ALERT(0, 0, "start - initForPM failed");
		releaseResources();
        return false;
    }
    
    fMSP430Interface->retain();
    
    registerService();
    
    XTRACE(this, 0, 0, "start - successful");
	
	IOLog("%s : Version number - %s, Input buffers %d, Output buffers %d\n", getName(), drvver, fInBufPool, fOutBufPool);
    
    return true;
    	
}/* end start */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::stop
//
//		Inputs:		provider - my provider
//
//		Outputs:	None
//
//		Desc:		Stops the driver
//
/****************************************************************************************************/

void MSP430LPCDC::stop(IOService *provider)
{
    IOReturn	ret;
    
    IOLog("%s : Stop - Unload",getName());
    
    XTRACE(this, 0, 0, "stop");
    
    fStopping = true;
    fReady = false;
    
    retain();
    ret = fCommandGate->runAction(stopAction);
    release();
	
	if (fWakeSettingControllerHandle)
	{
		fWakeSettingControllerHandle->release();
	}
	
	if (fPMRootDomain)
	{
		fPMRootDomain->deRegisterInterestedDriver(this);
	}
        
    removeProperty((const char *)propertyTag);
    
	if (!fTerminate)				// If we're terminated this has already been done
	{
		releaseResources();
	}
    
	PMstop();
    
    super::stop(provider);

}/* end stop */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::stopAction
//
//		Desc:		Dummy pass through for stopGated.
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::stopAction(OSObject *owner, void *, void *, void *, void *)
{

    ((MSP430LPCDC *)owner)->stopGated();
    
    return kIOReturnSuccess;
    
}/* end stopAction */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::stopGated
//
//		Inputs:		
//
//		Outputs:	
//
//		Desc:		Releases the resources 
//
/****************************************************************************************************/

void MSP430LPCDC::stopGated()
{
    
    XTRACE(this, 0, 0, "stopGated");
    
    releaseResources();
	
}/* end stopGated */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::createSuffix
//
//		Inputs:		
//
//		Outputs:	return Code - true (suffix created), false (suffix not create)
//				sufKey - the key
//
//		Desc:		Creates the suffix key. It attempts to use the serial number string from the device
//				if it's reasonable i.e. less than 8 bytes ascii. Remember it's stored in unicode 
//				format. If it's not present or not reasonable it will generate the suffix based 
//				on the location property tag. At least this remains the same across boots if the
//				device is plugged into the same physical location. In the latter case trailing
//				zeros are removed.
//				The interface number is also added to make it unique for
//				multiple CDC configuration devices.
//
/****************************************************************************************************/

bool MSP430LPCDC::createSuffix(unsigned char *sufKey)
{
    
    UInt8	serBuf[25];	

    UInt8	indx;
    bool	keyOK = false;			
	
    XTRACE(this, 0, 0, "createSuffix");
	
    indx = fMSP430Interface->GetDevice()->GetSerialNumberStringIndex();	
    
    if (indx != 0)
    {	
            // Generate suffix key based on the serial number string

        fMSP430Interface->GetDevice()->GetStringDescriptor(indx, (char *)&serBuf, sizeof(serBuf));
        strlcpy((char *)sufKey, (const char *)&serBuf, (strlen((char *)&serBuf))+1);          
        keyOK = true;  
    }
        

    return keyOK;

}/* end createSuffix */





bool MSP430LPCDC::findSerialBSDClient (IOModemSerialStreamSync *nub) 
{
	IOReturn							resultCode = kIOReturnError;
	
