robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
	bsdClientState = 0;
	
	XTRACE (this, 0, 0,"findSerialBSDClient Adding notification with custom matching dictionary");
	bsdClientAddedNotifier = addMatchingNotification (gIOFirstPublishNotification,
													  serviceMatching("IOSerialBSDClient"),
													  (IOServiceMatchingNotificationHandler)&bsdClientPublished,
													  this,
													  nub);	
	
	resultCode = fCommandGate->runAction(waitForBSDClienAction);	
	XTRACE (this, 0, resultCode, "findSerialBSDClient Exiting....");	
	if (resultCode == kIOReturnSuccess)
		return TRUE;
	else
		return FALSE;	
}

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::waitForBSDClienAction
//
//		Desc:		Dummy pass through for sendDeviceRequestGated
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::waitForBSDClienAction(OSObject *owner, void *, void *, void *, void *)
{
    return ((MSP430LPCDC *)owner)->waitForBSDClientGated();
}   // end sendDeviceRequestAction


/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::waitForBSDClientGated
//
//		Inputs:		
//
//		Outputs:	return Code - true that the device object appeared
//
//		Desc:		wait for the BSDClient object to be ready 
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::waitForBSDClientGated()
{
    IOReturn	result = kIOReturnSuccess;
	
	AbsoluteTime	when;
	uint64_t		now,offset,whentime;
    
#define AbsoluteTime_to_scalar(x)    (*(uint64_t *)(x))
    
#define CMP_ABSOLUTETIME(t1, t2)                \
(AbsoluteTime_to_scalar(t1) >                \
AbsoluteTime_to_scalar(t2)? (int)+1 :    \
(AbsoluteTime_to_scalar(t1) <                \
AbsoluteTime_to_scalar(t2)? (int)-1 : 0))
    
    /* t1 += t2 */
#define ADD_ABSOLUTETIME(t1, t2)                \
(AbsoluteTime_to_scalar(t1) +=                \
AbsoluteTime_to_scalar(t2))
    
    /* t1 -= t2 */
#define SUB_ABSOLUTETIME(t1, t2)                \
(AbsoluteTime_to_scalar(t1) -=                \
AbsoluteTime_to_scalar(t2))
    
#define ADD_ABSOLUTETIME_TICKS(t1, ticks)        \
(AbsoluteTime_to_scalar(t1) +=                \
(int32_t)(ticks))
		
    
	now = mach_absolute_time();
	nanoseconds_to_absolutetime (9000000000ULL, &offset);	//rcs We will wait for up to 9 Seconds before timing out..
	ADD_ABSOLUTETIME (&now, &offset);	//when we timeout
	nanoseconds_to_absolutetime (now, &whentime);	//rcs We will wait for up to 9 Seconds before timing out..
    
    when = * (AbsoluteTime*) &(whentime);
    
	if (bsdClientState == 1)
	{
        IOLog( "waitForBSDClientGated - bsdClientState is already 1 no need to wait...\n"); 
		XTRACE(this, 0, 0, "waitForBSDClientGated - bsdClientState is already 1 no need to wait..."); //Sometimes the match callback gets called before this...
		return result; //no Need it was already published....
	}
	
	result = fCommandGate->commandSleep((void *) &bsdClientState, when, THREAD_INTERRUPTIBLE);
	//	result = fCommandGate->commandSleep((void *) &bsdClientState);
	
	if (result == THREAD_TIMED_OUT)
	{
		result = kIOReturnTimeout;
		XTRACE(this, 0, 0, "waitForBSDClientGated - fCommandGate returned THREAD_TIMED_OUT");
		return result;
	}
	else if (result == THREAD_INTERRUPTED)
	{
		result = kIOReturnAborted;
		XTRACE(this, 0, 0, "waitForBSDClientGated - fCommandGate returned THREAD_INTERRUPTED");
		return result;
	}
	
	XTRACE(this, 0, 0, "waitForBSDClientGated - Exit");
    return result;
}

bool MSP430LPCDC::bsdClientPublished (MSP430LPCDC * target, void * ref, IOService * newService, IONotifier * notifier) 
{
	bool	resultCode = TRUE;
	
	resultCode = FALSE;	// Assume failure
	
	XTRACE(target, 0, 0, "bsdClientPublished");
	
	if (ref == newService->getProvider()) //is the bsdclient that was just published the one we created (since they can be multiple IOBSDClient objects on any given Sunday)
	{
		XTRACE (target, 0, 0, "bsdClientPublished - waking up command gate + removing Notifier");
		notifier->remove();
		resultCode = TRUE;
		target->bsdClientState = 1;
		target->fCommandGate->commandWakeup((void *) &target->bsdClientState);
	}
	return resultCode;
}


/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::createSerialStream
//
//		Inputs:		
//
//		Outputs:	return Code - true (created and initialilzed ok), false (it failed)
//
//		Desc:		Creates and initializes the nub
//
/****************************************************************************************************/

bool MSP430LPCDC::createSerialStream()
{
    IOModemSerialStreamSync	*pNub = new IOModemSerialStreamSync;
    bool			ret;
    UInt8			indx;
    IOReturn			rc;
    unsigned char		rname[25];
	OSString			*portName;
    const char			*suffix = (const char *)&rname;
//	OSBoolean			*hideProp = NULL;
	
	OSString *portSuffixString = NULL;
	OSDictionary *fInfoCommands = NULL;
	OSDictionary *hiddenProperties = NULL;
	UInt32		ttyNameSize = 0;
	char		*ttyName = NULL;
	OSString	*ttyNameStr = NULL;
//    char    	*serBuf[20];
		
    XTRACEP(this, 0, pNub, "createSerialStream");
    
    if (!pNub)
    {
		XTRACEP(this, 0, pNub, "createSerialStream - Could not create serial stream");
        return false;
    }
		
    	// Either we attached and should get rid of our reference
    	// or we failed in which case we should get rid our reference as well.
        // This just makes sure the reference count is correct.
	
    ret = (pNub->init(0, 0) && pNub->attach(this));
	
    pNub->release();
    if (!ret)
    {
        XTRACE(this, ret, 0, "createSerialStream - Failed to attach to the nub");
        return false;
    }

	if (fWanDevice == kOSBooleanTrue)
		pNub->setProperty("WWAN", true);
	else
	{
		XTRACE(this, 0, 0, "createSerialStream - NON WAN CDC Device");
	}
	

		// Get the name from the InterfaceMapping dictionary.
		
	portName = getPortNameForInterface(fMSP430Interface->GetInterfaceNumber());
    
	if (portName != NULL)
	{
		pNub->setProperty(kIOTTYBaseNameKey, portName->getCStringNoCopy());
		if (!(portName->isEqualTo("wwan")))
		{
				pNub->setProperty((const char *)hiddenTag, true);
				pNub->setProperty((const char *)WWANTag, true);
		}
	} else {	
			// Report the base name to be used for generating device nodes
        
        pNub->setProperty(kIOTTYBaseNameKey, "uart-");
		XTRACE(this, 0, fMSP430Interface->GetInterfaceNumber(), "createSerialStream - using default naming and suffix...");
	
			// Create suffix key and set it
	
		if (createSuffix((unsigned char *)suffix))
		{	            
			pNub->setProperty(kIOTTYSuffixKey, suffix);
		}
	}
    
    pNub->registerService();
	
	XTRACE(this, 0, 0, "createSerialStream - wait for a sec...");
	if (!findSerialBSDClient(pNub))
	{
		XTRACE (this, 0, 0, "createSerialStream - findSerialBSDClient failed terminating nub");
		pNub->close(this);
		XTRACE (this, 0, 0, "createSerialStream - findSerialBSDClient returning false");
		return false;
	}
	
