robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
    fInfoCommands = (OSDictionary *) fMSP430Interface->GetDevice()->getProperty("InfoCommands");
	
	if ( (fInfoCommands != NULL) && (portName != NULL) )
	{
		hiddenProperties = (OSDictionary *) fInfoCommands->getObject("HiddenProperties");
		if (hiddenProperties)
		{
			portSuffixString = (OSSymbol *) pNub->copyProperty(kIOTTYSuffixKey);
			
			if (portSuffixString != NULL)
			{
				if ( (portSuffixString->getCStringNoCopy() != NULL) )
				{
						OSCollectionIterator *propertyIterator;		
						propertyIterator = OSCollectionIterator::withCollection( hiddenProperties);
						
						if ( propertyIterator != NULL )
						{
							OSString *key;
							propertyIterator->reset();
							
							while( (key = (OSString *)propertyIterator->getNextObject()))
							{
								OSString *value;
								value = (OSString *) hiddenProperties->getObject(key);
																
								if (value->isEqualTo(portName))
								{
									ttyNameSize = (portSuffixString->getLength() + portName->getLength() );						
									ttyName = (char *)IOMallocAligned(ttyNameSize+4, sizeof (char));
									bzero(ttyName,ttyNameSize+4);
									strncpy(ttyName, value->getCStringNoCopy(), value->getLength());
									strncat(ttyName, portSuffixString->getCStringNoCopy(), portSuffixString->getLength());
									
									ttyNameStr = OSString::withCString(ttyName);
									if ( ttyNameStr != NULL )
									{
										//OSString *foo;
										XTRACE(this, 0, 0, "createSerialStream - hiddenProperties: collision");
										fMSP430Interface->GetDevice()->setProperty(key->getCStringNoCopy(),ttyNameStr);
										//hiddenProperties->setObject(key->getCStringNoCopy(),ttyNameStr);
										
										//foo = (OSString *)hiddenProperties->getObject(key->getCStringNoCopy());
										//hiddenProperties->setObject(foo,ttyNameStr);
									}
									}
							} 		
							propertyIterator->release();
						}	else { XTRACE(this, 0, 0, "createSerialStream - propertyIterator is NULL...");}		
				} else { XTRACE(this, 0, 0, "createSerialStream - portSuffixString->getCStringNoCopy is NULL...");}
			} else { XTRACE(this, 0, 0, "createSerialStream - portSuffixString is NULL...");}
		} else { XTRACE(this, 0, 0, "createSerialStream - hiddenProperties is NULL...");}
	} else { XTRACE(this, 0, fMSP430Interface->GetInterfaceNumber(), "createSerialStream - fInfoCommands or portname is NULL...");}
	
    // Save the Product String (at least the first productNameLength's worth).

    indx = fMSP430Interface->GetDevice()->GetProductStringIndex();	
    
    if (indx != 0)
    {	
        rc = fMSP430Interface->GetDevice()->GetStringDescriptor(indx, (char *)&fProductName, sizeof(fProductName));
        if (!rc)
        {
            if (strlen((char *)fProductName) == 0)		// Believe it or not this sometimes happens - null string with an index defined???
            {
				strlcpy((char *)fProductName, defaultName, sizeof(defaultName));
//                strcpy((char *)fProductName, defaultName);
            }
            pNub->setProperty((const char *)propertyTag, (const char *)fProductName);
        }
    }

    return true;
	
}/* end createSerialStream */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::acquirePort
//
//		Inputs:		sleep - true (wait for it), false (don't)
//				refCon - unused
//
//		Outputs:	Return Code - kIOReturnSuccess, kIOReturnExclusiveAccess, kIOReturnIOError and various others
//
//		Desc:		Set up for gated acquirePort call.
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::acquirePort(bool sleep, void *refCon)
{
    IOReturn                ret;
    
    XTRACEP(this, refCon, 0, "acquirePort");
	
		// Check for being acquired after stop has been issued and before start
		
	if (fTerminate || fStopping)
	{
		XTRACE(this, 0, 0, "acquirePort - Offline");
		return kIOReturnOffline;
	}
	
		// Make sure we have a valid workloop
	
	if (!fWorkLoop)
    {
        XTRACE(this, 0, 0, "acquirePort - No workLoop");
        return kIOReturnOffline;
    }
    
        // Make sure start has finished (could be different threads)
    
    if (!fReady)
    {
        XTRACE(this, 0, 0, "acquirePort - Not ready");
		return kIOReturnNotReady;
    }
    
        // Find the matching control driver first (we're obviously not ready if he hasn't arrived)
        
    if (!fControlDriver)
    {
        fControlDriver = findControlDriverAD(this);
        if (fControlDriver == NULL)
        {
            XTRACE(this, 0, 0, "acquirePort - Cannot find control driver");
            return kIOReturnNotReady;
        }
    }

    retain();
    ret = fCommandGate->runAction(acquirePortAction, (void *)sleep);
    release();

    return ret;

}/* end acquirePort */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::acquirePortAction
//
//		Desc:		Dummy pass through for acquirePortGated.
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::acquirePortAction(OSObject *owner, void *arg0, void *, void *, void *)
{

    return ((MSP430LPCDC *)owner)->acquirePortGated((bool)arg0);
    
}/* end acquirePortAction */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::acquirePortGated
//
//		Inputs:		sleep - true (wait for it), false (don't)
//
//		Outputs:	Return Code - kIOReturnSuccess, kIOReturnExclusiveAccess, kIOReturnIOError and various others
//
//		Desc:		acquirePort tests and sets the state of the port object.  If the port was
// 				available, then the state is set to busy, and kIOReturnSuccess is returned.
// 				If the port was already busy and sleep is YES, then the thread will sleep
// 				until the port is freed, then re-attempts the acquire.  If the port was
// 				already busy and sleep is NO, then kIOReturnExclusiveAccess is returned.
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::acquirePortGated(bool sleep)
{
    UInt32 	busyState = 0;
    IOReturn 	rtn = kIOReturnSuccess;
    UInt16	i;
	UInt32	state;
	UInt32	mask;

    XTRACE(this, 0, sleep, "acquirePortGated");

    retain(); 							// Hold reference till releasePortGated, unless we fail to acquire
    while (true)
    {
        busyState = fPort.State & PD_S_ACQUIRED;
        if (!busyState)
        {		
                // Set busy bit (acquired), and clear everything else
                
			state = PD_S_ACQUIRED | DEFAULT_STATE;
			mask = STATE_ALL;
            setStateGated(&state, &mask);
            break;
        } else {
            if (!sleep)
            {
                XTRACE(this, 0, 0, "acquirePortGated - Busy exclusive access");
                release();
            	return kIOReturnExclusiveAccess;
            } else {
            	busyState = 0;
				mask = PD_S_ACQUIRED;
            	rtn = watchStateGated(&busyState, &mask);
            	if ((rtn == kIOReturnIOError) || (rtn == kIOReturnSuccess))
                {
                    continue;
            	} else {
                    XTRACE(this, 0, 0, "acquirePortGated - Interrupted!");
                    release();
                    return rtn;
                }
            }
        }
    }
    
    do
    {    	
        setStructureDefaults();				// Set the default values
        
            // Set up and read the data-in bulk pipe
        
        for (i=0; i<fInBufPool; i++)
        {
            if (fPort.inPool[i].pipeMDP)
            {
                fPort.inPool[i].completionInfo.target = this;
                fPort.inPool[i].completionInfo.action = dataReadComplete;
                fPort.inPool[i].completionInfo.parameter = (void *)&fPort.inPool[i];
                rtn = fPort.InPipe->Read(fPort.inPool[i].pipeMDP, &fPort.inPool[i].completionInfo, NULL);
                if (rtn != kIOReturnSuccess)
                {
                    XTRACE(this, i, rtn, "acquirePortGated - Read for bulk-in pipe failed");
					fPort.inPool[i].dead = true;
                    break;
                }
				XTRACEP(this, &fPort.inPool[i], fPort.InPipe, "acquirePortGated - Read posted");
            }
        }
        if (rtn == kIOReturnSuccess)
        {
        
                // Set up the data-out bulk pipe
		
            for (i=0; i<fOutBufPool; i++)
            {
                if (fPort.outPool[i].pipeMDP)
                {
                    fPort.outPool[i].completionInfo.target = this;
                    fPort.outPool[i].completionInfo.action = dataWriteComplete;
                    fPort.outPool[i].completionInfo.parameter = (void *)&fPort.outPool[i];
                }
            }
        } else {
            break;
        }

        fSessions++;					// Bump number of active sessions and turn on clear to send
		state = PD_RS232_S_CTS;
		mask = PD_RS232_S_CTS;
		setStateGated(&state, &mask);
        
            // Tell the Control driver we're good to go
        
		if (fControlDriver)
		{
			if (!fControlDriver->dataAcquired())
			{
				XTRACE(this, 0, 0, "acquirePortGated - dataAcquired to Control failed");
				break;
			}
		}
        
