robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
IOReturn MSP430LPCDC::setState(UInt32 state, UInt32 mask, void *refCon)
{
    IOReturn	ret = kIOReturnSuccess;
    
    XTRACE(this, 0, 0, "setState");
    
    if (fTerminate || fStopping)
    {
        XTRACE(this, 0, kIOReturnOffline, "setState - Offline");
        return 0;
    }
    
        // Cannot acquire or activate via setState
    
    if (mask & (PD_S_ACQUIRED | PD_S_ACTIVE | (~EXTERNAL_MASK)))
    {
        ret = kIOReturnBadArgument;
    } else {
        
            // ignore any bits that are read-only
        
        mask &= (~fPort.FlowControl & PD_RS232_A_MASK) | PD_S_MASK;
        if (mask)
        {
            retain();
            ret = fCommandGate->runAction(setStateAction, (void *)&state, (void *)&mask);
            release();
        }
    }
    
    return ret;
    
}/* end setState */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::setStateAction
//
//		Desc:		Dummy pass through for setStateGated.
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::setStateAction(OSObject *owner, void *arg0, void *arg1, void *, void *)
{

    return ((MSP430LPCDC *)owner)->setStateGated((UInt32 *)arg0, (UInt32 *)arg1);
    
}/* end setStateAction */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::setStateGated
//
//		Inputs:		state - state to set
//				mask - state mask
//
//		Outputs:	Return Code - kIOReturnSuccess or kIOReturnBadArgument
//
//		Desc:		Set the state for the port device.  The lower 16 bits are used to set the
//				state of various flow control bits (this can also be done by enqueueing a
//				PD_E_FLOW_CONTROL event).  If any of the flow control bits have been set
//				for automatic control, then they can't be changed by setState.  For flow
//				control bits set to manual (that are implemented in hardware), the lines
//				will be changed before this method returns.  The one weird case is if RXO
//				is set for manual, then an XON or XOFF character may be placed at the end
//				of the TXQ and transmitted later.
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::setStateGated(UInt32 *pState, UInt32 *pMask)
{
	UInt32	state = *pState;
	UInt32	mask = *pMask;
    UInt32	delta;
	bool	controlUpdate = false;
	UInt32	DTRstate;
	UInt32	RTSstate;
	bool	DTRnew = false;
	bool	RTSnew = false;
	
    XTRACE(this, state, mask, "setStateGated");
    
    if (fStopping)
        return kIOReturnOffline;
    
        // Check if it's being acquired or already acquired

    if ((state & PD_S_ACQUIRED) || (fPort.State & PD_S_ACQUIRED))
    {
		XTRACE(this, state, mask, "setState - Requested state and mask");
		XTRACE(this, 0, fPort.State, "setState - Current state");
		DTRstate = fPort.State & PD_RS232_S_DTR;
		RTSstate = fPort.State & PD_RS232_S_RTS;
		XTRACE(this, DTRstate, RTSstate, "setState - DTRstate and RTSstate");
		
			// Set the new state based on the current setting
			
		if (fPort.State & PD_RS232_S_DTR)
		{
			DTRnew = true;
		}
		if (fPort.State & PD_RS232_S_RTS)
		{
			RTSnew = true;
		}
		XTRACE(this, DTRnew, RTSnew, "setState - DTRstate and RTSstate");
		
			// Handle DTR and RTS changes for the modem
		
        if (mask & PD_RS232_S_DTR)
        {
            if ((state & PD_RS232_S_DTR) != (fPort.State & PD_RS232_S_DTR))
            {
				controlUpdate = true;
                if (state & PD_RS232_S_DTR)
                {
                    XTRACE(this, 0, 0, "setState - Changing DTR to ON");
					DTRnew = true;
                } else {
					XTRACE(this, 0, 0, "setState - Changing DTR to OFF");
					DTRnew = false;
                }
            } else {
				XTRACE(this, 0, DTRstate, "setState - DTR state unchanged");
			}
        }
		if (mask & PD_RS232_S_RTS)
		{
			if ((state & PD_RS232_S_RTS) != (fPort.State & PD_RS232_S_RTS))
            {
				controlUpdate = true;
                if (state & PD_RS232_S_RTS)
                {
                    XTRACE(this, 0, 0, "setState - Changing RTS to ON");
					RTSnew = true;
                } else {
					XTRACE(this, 0, 0, "setState - Changing RTS to OFF");
					RTSnew = false;
                }
            } else {
				XTRACE(this, 0, RTSstate, "setState - RTS state unchanged");
			}
		}
		
		XTRACE(this, DTRnew, RTSnew, "setState - DTRnew and RTSnew");
		
		if ((!fTerminate) && (controlUpdate))
		{
			setControlLineState(RTSnew, DTRnew);
		}
        
        state = (fPort.State & ~mask) | (state & mask); 		// compute the new state
        delta = state ^ fPort.State;		    			// keep a copy of the diffs
        fPort.State = state;

	    // Wake up all threads asleep on WatchStateMask
		
        if (delta & fPort.WatchStateMask)
        {
            fCommandGate->commandWakeup((void *)&fPort.State);
        }
        
        return kIOReturnSuccess;

    } else {
        XTRACE(this, fPort.State, 0, "setStateGated - Not Acquired");
    }
    
    return kIOReturnNotOpen;
	
}/* end setStateGated */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::watchState
//
//		Inputs:		state - state to watch for
//				mask - state mask bits
//				refCon - unused
//
//		Outputs:	Return Code - kIOReturnSuccess or value returned from ::watchState
//
//		Desc:		Set up for gated watchState call.
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::watchState(UInt32 *state, UInt32 mask, void *refCon)
{
    IOReturn 	ret;

    XTRACE(this, *state, mask, "watchState");
    
    if (fTerminate || fStopping)
    {
        XTRACE(this, 0, kIOReturnOffline, "watchState - Offline");
        return kIOReturnOffline;
    }
    
    if (!state) 
        return kIOReturnBadArgument;
        
    if (!mask)
        return kIOReturnSuccess;

    retain();
    ret = fCommandGate->runAction(watchStateAction, (void *)state, (void *)&mask);
    release();
    
    return ret;

}/* end watchState */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::watchStateAction
//
//		Desc:		Dummy pass through for watchStateGated.
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::watchStateAction(OSObject *owner, void *arg0, void *arg1, void *, void *)
{

    return ((MSP430LPCDC *)owner)->watchStateGated((UInt32 *)arg0, (UInt32 *)arg1);
    
}/* end watchStateAction */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::watchStateGated
//
//		Inputs:		state - state to watch for
//				mask - state mask bits
//
//		Outputs:	Return Code - kIOReturnSuccess or value returned from privateWatchState
//
//		Desc:		Wait for the at least one of the state bits defined in mask to be equal
//				to the value defined in state. Check on entry then sleep until necessary,
//				A return value of kIOReturnSuccess means that at least one of the port state
//				bits specified by mask is equal to the value passed in by state.  A return
//				value of kIOReturnIOError indicates that the port went inactive.  A return
//				value of kIOReturnIPCError indicates sleep was interrupted by a signal.
//
/****************************************************************************************************/

