robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
    XTRACEP(this, 0, fPort.TX.Start, "allocateDataResources - TX ring buffer");
    
    if (!allocateRingBuffer(&fPort.RX, fPort.RXStats.BufferSize)) 
    {
        XTRACE(this, 0, 0, "allocateDataResources - Couldn't allocate RX ring buffer");
        return false;
    }
    
    XTRACEP(this, 0, fPort.RX.Start, "allocateDataResources - RX ring buffer");
    
    return true;
	
}/* end allocateDataResources */


/****************************************************************************************************/
//
//		Method:		AppleUSBCDCACMControl::allocateCommResources
//
//		Inputs:		
//
//		Outputs:	return code - true (allocate was successful), false (it failed)
//
//		Desc:		Finishes up the rest of the configuration and gets all the endpoints open etc.
//
/****************************************************************************************************/

bool MSP430LPCDC::allocateCommResources()
{
    IOUSBFindEndpointRequest	epReq;
    
    XTRACE(this, 0, 0, "allocateCommResources.");
    
    // Open the end point and get the buffers
    
/*    if (!fMSP430Interface->open(this))
    {
        XTRACE(this, 0, 0, "allocateCommResources - open comm interface failed.");
        return false;
    }

 */
    // Interrupt pipe
    
    epReq.type = kUSBInterrupt;
    epReq.direction = kUSBIn;
    fCommPipe = fMSP430Interface->FindNextPipe(0, &epReq);
    if (!fCommPipe)
    {
        XTRACE(this, 0, 0, "allocateCommResources - no comm pipe.");
        return false;
    }
    XTRACE(this, epReq.maxPacketSize << 16 |epReq.interval, 0, "allocateCommResources - comm pipe.");
    
    // Allocate Memory Descriptor Pointer with memory for the Interrupt pipe:
    
    fCommPipeMDP = IOBufferMemoryDescriptor::withCapacity(COMM_BUFF_SIZE, kIODirectionIn);
    if (!fCommPipeMDP)
    {
        XTRACE(this, 0, 0, "allocateCommResources - Couldn't allocate MDP for interrupt pipe");
        return false;
    }
    
    fCommPipeBuffer = (UInt8*)fCommPipeMDP->getBytesNoCopy();
    XTRACEP(this, 0, fCommPipeBuffer, "allocateCommResources - comm buffer");
    
    return true;
	
}/* end allocateCommResources */



/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::releaseCommResources
//
//		Inputs:		
//
//		Outputs:	
//
//		Desc:		Frees up the resources allocated in allocateCommResources
//
/****************************************************************************************************/

void MSP430LPCDC::releaseResources()
{
    UInt16	i;
    
    XTRACE(this, 0, 0, "releaseResources");
	
	if (fMSP430Interface)	
    { 
        fMSP430Interface->close(this);
        fMSP430Interface->release();
        fMSP430Interface = NULL;
    }
    
    for (i=0; i<fInBufPool; i++)
    {
        if (fPort.inPool[i].pipeMDP)	
        { 
            fPort.inPool[i].pipeMDP->release();	
            fPort.inPool[i].pipeMDP = NULL;
            fPort.inPool[i].dead = false;
        }
    }
	
    for (i=0; i<fOutBufPool; i++)
    {
        if (fPort.outPool[i].pipeMDP)	
        { 
            fPort.outPool[i].pipeMDP->release();	
            fPort.outPool[i].pipeMDP = NULL;
            fPort.outPool[i].count = -1;
            fPort.outPool[i].avail = false;
        }
    }
    fPort.outPoolIndex = 0;
    
    if (fWorkLoop)
    {
        fWorkLoop->release();
        fWorkLoop = NULL;
    }

    freeRingBuffer(&fPort.TX);
    freeRingBuffer(&fPort.RX);
    
    if (fCommPipeMDP)	
    { 
        fCommPipeMDP->release();	
        fCommPipeMDP = 0; 
    }
	
}/* end releaseResources */


/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::freeRingBuffer
//
//		Inputs:		Queue - the specified queue to free
//
//		Outputs:	
//
//		Desc:		Frees all resources assocated with the queue, then sets all queue parameters 
//				to safe values.
//
/****************************************************************************************************/

void MSP430LPCDC::freeRingBuffer(CirQueue *Queue)
{
    XTRACEP(this, 0, Queue, "freeRingBuffer");

    if (Queue)
    {
        if (Queue->Start)
        {
            IOFree(Queue->Start, Queue->Size);
        }
        CloseQueue(Queue);
    }
	
}/* end freeRingBuffer */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::allocateRingBuffer
//
//		Inputs:		Queue - the specified queue to allocate
//				BufferSize - size to allocate
//
//		Outputs:	return Code - true (buffer allocated), false (it failed)
//
//		Desc:		Allocates resources needed by the queue, then sets up all queue parameters. 
//
/****************************************************************************************************/

bool MSP430LPCDC::allocateRingBuffer(CirQueue *Queue, size_t BufferSize)
{
    UInt8	*Buffer;

        // Size is ignored and kMaxCirBufferSize, which is 4096, is used.
		
    XTRACE(this, 0, BufferSize, "allocateRingBuffer");
    Buffer = (UInt8*)IOMalloc(kMaxCirBufferSize);

    InitQueue(Queue, Buffer, kMaxCirBufferSize);

    if (Buffer)
        return true;

    return false;
	
}/* end allocateRingBuffer */

/****************************************************************************************************/
//
//		Function:	MSP430LPCDC::handleSettingCallback
//
//		Inputs:		
//
//		Outputs:	none	
//
//		Desc:		Handles the async Wake on Ring setting
//
/****************************************************************************************************/

void MSP430LPCDC::handleSettingCallback(const OSSymbol *arg_type, OSObject *arg_val, uintptr_t refcon)
{
    UInt32				WoR;
	
	XTRACE(this, 0, 0, "handleSettingCallback");
		
    WoR = ((OSNumber *)arg_val)->unsigned32BitValue();
    
	if (arg_type == gPMWakeOnRingSymbol)
	{
		if (WoR != fWoR)
		{
			fWoR = WoR;
			if (fTerminate || fStopping)
			{
				XTRACE(this, 0, 0, "handleSettingCallback - Offline");
				return;
			}
			setWakeFeature();
		} else {
			XTRACE(this, 0, 0, "handleSettingCallback - Wake on Ring unchanged");
		}
    }
	
}/* end handleSettingCallback */

/****************************************************************************************************/
//
//		Function:	MSP430LPCDC::setupWakeOnRingPMCallback
//
//		Inputs:		none
//
//		Outputs:	return code - true( callback enabled), false(disabled)	
//
//		Desc:		Set up the PM callback for Wake on Ring
//
/****************************************************************************************************/

