robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
bool MSP430LPCDC::setupWakeOnRingPMCallback()
{
	IOReturn		ior;
	bool			worOK = false;
    const OSSymbol	*settings_arr[] = {gPMWakeOnRingSymbol, (const OSSymbol *)NULL};
	
	XTRACE(this, 0, 0, "setupWakeOnRingPMCallback");
	
	if (fPMRootDomain)
	{
		fPMRootDomain->publishFeature("WakeOnRing");
    
		ior = fPMRootDomain->registerPMSettingController(settings_arr,
														 OSMemberFunctionCast(IOPMSettingControllerCallback,
														 (OSObject*)this,
														 &MSP430LPCDC::handleSettingCallback),
														 (OSObject *)this,
														 (uintptr_t)NULL,
														 (OSObject **)&fWakeSettingControllerHandle);
		if (ior == kIOReturnSuccess)
		{
			XTRACE(this, 0, 0, "setupWakeOnRingPMCallback - Setting PM callback successful");
			worOK = true;
		} else {
			XTRACE(this, 0, 0, "setupWakeOnRingPMCallback - Setting PM callback failed, wake-on-ring set at start only");
		}
	} else {
		XTRACE(this, 0, 0, "setupWakeOnRingPMCallback - PM root domain is invalid, wake-on-ring set at start only");
	}
	
    return worOK;
	
}/* end setupWakeOnRingPMCallback */

/****************************************************************************************************/
//
//		Function:	MSP430LPCDC::WakeonRing
//
//		Inputs:		none
//
//		Outputs:	return code - true(always at the moment...)	
//
//		Desc:		Get the current Wake on Ring setting
//
/****************************************************************************************************/

bool MSP430LPCDC::WakeonRing(void)
{
    OSObject	*initWORValue = NULL;
	UInt32		worVal;
	
    XTRACE(this, 0, 0, "WakeonRing");
        
    fPMRootDomain = getPMRootDomain();
	if (fPMRootDomain)
	{
		fPMRootDomain->registerInterestedDriver(this);
        
		initWORValue = fPMRootDomain->copyPMSetting((OSSymbol *)gPMWakeOnRingSymbol);
		if (initWORValue)
		{
			worVal = ((OSNumber *)initWORValue)->unsigned32BitValue();
			if (worVal)
			{
				XTRACE(this, 0, worVal, "WakeonRing - Wake on Ring Enabled");
				fWoR = true;
			} else {
				XTRACE(this, 0, 0, "WakeonRing - Wake on Ring Disabled");
			}
		} else {
			XTRACE(this, 0, 0, "WakeonRing - Initial Wake on Ring unavailable, now disabled...");
		}
	} else {
		XTRACE(this, 0, 0, "WakeonRing - Remote wake up is disabled");
	}
    
    return true;
    
}/* end WakeonRing */

/****************************************************************************************************/
//
//		Function:	MSP430LPCDC::setWakeFeature
//
//		Inputs:		none
//
//		Outputs:	none
//
//		Desc:		Check the wake-on-ring feature and send the device request
//
/****************************************************************************************************/

void MSP430LPCDC::setWakeFeature(void)
{
	IOUSBDevRequest devreq;
	IOReturn		ior;

    XTRACE(this, 0, 0, "setWakeFeature");
	    
		// Set/Clear the Device Remote Wake feature depending upon wake-on-ring
    
	devreq.bmRequestType = USBmakebmRequestType(kUSBOut, kUSBStandard, kUSBDevice);
	if (!fWoR)				
	{
		devreq.bRequest = kUSBRqClearFeature;
	} else {
		devreq.bRequest = kUSBRqSetFeature;
	}
	devreq.wValue = kUSBFeatureDeviceRemoteWakeup;
	devreq.wIndex = 0;
	devreq.wLength = 0;
	devreq.pData = 0;

	ior = fMSP430Interface->GetDevice()->DeviceRequest(&devreq);
	if (ior == kIOReturnSuccess)
	{
		XTRACE(this, fWoR, ior, "setWakeFeature - Set/Clear remote wake up feature successful");
	} else {
		XTRACE(this, fWoR, ior, "setWakeFeature - Set/Clear remote wake up feature failed");
	}

}/* end setWakeFeature */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::clearSleepingThreads
//
//		Inputs:		
//
//		Outputs:	
//
//		Desc:		Try to clear any threads asleep on the command gate
//
/****************************************************************************************************/

void MSP430LPCDC::clearSleepingThreads()
{
	
	XTRACE(this, 0, fThreadSleepCount, "clearSleepingThreads");
    
        // If we still have a command gate clean up anything sleeping on it
    
    if (fCommandGate)
    {
        if (fThreadSleepCount > 0)
        {
            fPort.WatchStateMask = 0;
            fCommandGate->commandWakeup((void *)&fPort.State);
        }
    }
		    
}/* end clearSleepingThreads */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::resurrectRead
//
//		Inputs:		
//
//		Outputs:	
//
//		Desc:		Try and resurrect any dead reads 
//
/****************************************************************************************************/

void MSP430LPCDC::resurrectRead()
{
    UInt16		i;
	IOReturn	rtn;
	
	XTRACE(this, 0, 0, "resurrectRead");
	
		// Let's check the pipes first
	
	if (fPort.InPipe)
	{
		checkPipe(fPort.InPipe, false);
	}
    
	if (fPort.OutPipe)
	{
		checkPipe(fPort.OutPipe, false);
	}

	for (i=0; i<fInBufPool; i++)
	{
		if (fPort.inPool[i].pipeMDP)
		{
			if (fPort.inPool[i].dead)
			{
				rtn = fPort.InPipe->Read(fPort.inPool[i].pipeMDP, &fPort.inPool[i].completionInfo, NULL);
				if (rtn != kIOReturnSuccess)
				{
					XTRACE(this, i, rtn, "resurrectRead - Read for bulk-in pipe failed, still dead");
				} else {
					XTRACEP(this, &fPort.inPool[i], fPort.InPipe, "resurrectRead - Read posted");
					fPort.inPool[i].dead = false;
				}
			}
		}
	}
	
}/* end resurrectRead */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::didTerminate
//
//		Inputs:		type - provider - my provider
//					options - additional parameters
//					defer - defer flag
//
//		Outputs:	return Code
//
//		Desc:		Handle did termination notification
//
/****************************************************************************************************/

bool MSP430LPCDC::didTerminate(IOService *provider, IOOptionBits options, bool *defer)
{
	bool	result = false;
	
	XTRACE(this, 0, fThreadSleepCount, "didTerminate");
    
    fTerminate = true;                  // Just to make sure
    
    clearSleepingThreads();             // All the threads should be gone by now but make sure
 	
