robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
	result = super::didTerminate(provider, options, defer);
	
	return result;
    
}/* end didTerminate */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::message
//
//		Inputs:		type - message type
//                  provider - my provider
//                  argument - additional parameters
//
//		Outputs:	return Code - kIOReturnSuccess
//
//		Desc:		Handles IOKit messages. 
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::message(UInt32 type, IOService *provider, void *argument)
{	
    IOReturn	rtn;
    
    XTRACE(this, 0, type, "message");
	
    switch (type)
    {
        case kIOMessageServiceIsTerminated:
            XTRACE(this, fSessions, type, "message - kIOMessageServiceIsTerminated");
			
				// As a precaution abort any I/O
			
			if (fPort.InPipe)
				fPort.InPipe->Abort();
			if (fPort.OutPipe)
				fPort.OutPipe->Abort();
			
			if (!fSuppressWarning)
			{
				if (fSessions)
				{
					if (!fTerminate)		// Check if we're already being terminated
					{ 
#if 0
							// NOTE! This call below depends on the hard coded path of this KEXT. Make sure
							// that if the KEXT moves, this path is changed!
						KUNCUserNotificationDisplayNotice(
						10,		// Timeout in seconds
						0,		// Flags (for later usage)
						"",		// iconPath (not supported yet)
						"",		// soundPath (not supported yet)
						"/System/Library/Extensions/IOUSBFamily.kext/Contents/PlugIns/MSP430LPCDC.kext",		// localizationPath
						"Unplug Header",		// the header
						"Unplug Notice",		// the notice - look in Localizable.strings
						"OK"); 
#endif
					}
				}
			}
            			
            fTerminate = true;		// We're being terminated (unplugged) let's see if we can clean up some threads and release some stuff
    
            releaseResources();
            return kIOReturnSuccess;
			
        case kIOMessageServiceIsSuspended: 	
            XTRACE(this, 0, type, "message - kIOMessageServiceIsSuspended");
            break;			
        case kIOMessageServiceIsResumed: 	
            XTRACE(this, 0, type, "message - kIOMessageServiceIsResumed");
            break;			
        case kIOMessageServiceIsRequestingClose: 
            XTRACE(this, 0, type, "message - kIOMessageServiceIsRequestingClose"); 
            break;
        case kIOMessageServiceWasClosed: 	
            XTRACE(this, 0, type, "message - kIOMessageServiceWasClosed"); 
            break;
        case kIOMessageServiceBusyStateChange: 	
            XTRACE(this, 0, type, "message - kIOMessageServiceBusyStateChange"); 
            break;
        case kIOUSBMessagePortHasBeenResumed: 	
            XTRACE(this, 0, type, "message - kIOUSBMessagePortHasBeenResumed");
			if (fReadDead)
			{
				rtn = fCommPipe->Read(fCommPipeMDP, &fCommCompletionInfo, NULL);
				if (rtn != kIOReturnSuccess)
				{
					XTRACE(this, 0, rtn, "message - Read for interrupt-in pipe failed, still dead");
				} else {
					fReadDead = false;
				}
			}
            resurrectRead();
            return kIOReturnSuccess;
        case kIOUSBMessageHubResumePort:
            XTRACE(this, 0, type, "message - kIOUSBMessageHubResumePort");
            break;
        case kIOUSBMessagePortHasBeenReset:
            XTRACE(this, 0, type, "message - kIOUSBMessagePortHasBeenReset");
			resurrectRead();
			if (fConfigAttributes & kUSBAtrRemoteWakeup)
			{
				setWakeFeature();
			}
			if (fReadDead)
			{
				rtn = fCommPipe->Read(fCommPipeMDP, &fCommCompletionInfo, NULL);
				if (rtn != kIOReturnSuccess)
				{
					XTRACE(this, 0, rtn, "message - Read for interrupt-in pipe failed, still dead");
				} else {
					fReadDead = false;
				}
			}
            return kIOReturnSuccess;

        default:
            XTRACE(this, 0, type, "message - unknown message"); 
            break;
    }
    
    return super::message(type, provider, argument);
    
}/* end message */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::getPortNameForInterface
//
//		Inputs:		interfaceNumber - the number of the interface we're interested in
//
//		Outputs:	return Code - NULL (not found) or the name
//
//		Desc:		Gets the name from the mapping 
//
/****************************************************************************************************/

OSString *MSP430LPCDC::getPortNameForInterface(UInt8 interfaceNumber)
{
	OSSymbol *ttyName = NULL;
	char	 endPointAddrStr[16];
	
	XTRACE(this, 0, interfaceNumber, "getPortNameForInterface");

	if (fInterfaceMappings)
	{		 
		snprintf(endPointAddrStr,sizeof(endPointAddrStr),"%d",interfaceNumber);		
		ttyName = (OSSymbol *)fInterfaceMappings->getObject(endPointAddrStr);			
	 }

	return ttyName;
	
}/* end getPortNameForInterface */

#undef  super
#define super IOUserClient

OSDefineMetaClassAndStructors(MSP430LPCDCUserClient, IOUserClient);

/****************************************************************************************************/
//
//		Method:		MSP430LPCDCUserClient::getTargetAndMethodForIndex
//
//		Inputs:		
//
//		Outputs:	return code - method index
//
//		Desc:		Get the method index. 
//
/****************************************************************************************************/

//IOExternalMethod *MSP430LPCDCUserClient::getExternalMethodForIndex(UInt32 index)
IOExternalMethod *MSP430LPCDCUserClient::getTargetAndMethodForIndex(IOService **targetP, UInt32 index)
{
    IOExternalMethod	*result = NULL;

    XTRACE(this, 0, index, "getTargetAndMethodForIndex");
    
    if (index == 0)
    {
        result = &fMethods[0];
		*targetP = this;
    }

    return result;
    
}/* end getTargetAndMethodForIndex */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDCUserClient::initWithTask
//
//		Inputs:		owningTask - the owner
//					security_id - Security ID
//					type - Client code (lucky number)
//
//		Outputs:	true - it worked, false - it didn't
//
//		Desc:		Set up the user client task. 
//
/****************************************************************************************************/

bool MSP430LPCDCUserClient::initWithTask(task_t owningTask, void *security_id , UInt32 type)
{

