robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
    return false;
    
}/* end checkInterfaceNumber */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::resetDevice
//
//		Inputs:		
//
//		Outputs:	
//
//		Desc:		Check to see if we need to reset the device on wakeup. 
//
/****************************************************************************************************/

void MSP430LPCDC::resetDevice(void)
{
    IOReturn 	rtn = kIOReturnSuccess;
    USBStatus	status;
    bool	reset = false;
	bool	reenum = false;
    
    XTRACE(this, 0, 0, "resetDevice");
	
	if ((fStopping) || (fMSP430Interface == NULL) || (fTerminate))
	{
		XTRACE(this, 0, 0, "resetDevice - returning early");
		return;
	}
	
    // Let everything settle down first
	
    //	IOSleep(100);
    
    rtn = fMSP430Interface->GetDevice()->GetDeviceStatus(&status);
    if (rtn != kIOReturnSuccess)
    {
        XTRACE(this, 0, rtn, "resetDevice - Error getting device status");
        reset = true;
    } else {
        status = USBToHostWord(status);
        XTRACE(this, 0, status, "resetDevice - Device status");
        if (status & kDeviceSelfPowered)			// Self powered devices that need "reset on close" will also be reset
        {
			if (fDataDriver)
			{
				if (fDataDriver->fResetOnClose)
				{
					reset = true;
				}
				if (fDataDriver->fEnumOnWake)
				{
					reenum = true;
				}
			}
        }
    }
	
	if ((fMSP430Interface) && (fDataDriver))			// Make sure the interface and data driver are still around
	{
		if (reenum)										// Enumeration takes precedent
		{
			fDataDriver->fTerminate = true;				// Warn the data driver early
			XTRACE(this, 0, 0, "resetDevice - Device is being re-enumerated");
			rtn = fMSP430Interface->GetDevice()->ReEnumerateDevice(0);
			if (rtn != kIOReturnSuccess)
			{
				XTRACE(this, 0, rtn, "resetDevice - ReEnumerateDevice failed");
			}
		} else {
			fDataDriver->fTerminate = false;
			if (reset)
			{
				XTRACE(this, 0, 0, "resetDevice - Device is being reset");
				rtn = fMSP430Interface->GetDevice()->ResetDevice();
				if (rtn != kIOReturnSuccess)
				{
					XTRACE(this, 0, rtn, "resetDevice - ResetDevice failed");
				}
			}
		}
    } else {
		XTRACE(this, 0, 0, "resetDevice - Control interface or Data driver has gone");
	}
	
}/* end resetDevice */



/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::initForPM
//
//		Inputs:		provider - my provider
//
//		Outputs:	return code - true(initialized), false(failed)
//
//		Desc:		Add ourselves to the power management tree so we can do
//				the right thing on sleep/wakeup. 
//
/****************************************************************************************************/

bool MSP430LPCDC::initForPM(IOService *provider)
{
    XTRACE(this, 0, 0, "initForPM");
    
    fPowerState = kCDCPowerOnState;				// init our power state to be 'on'
    PMinit();							// init power manager instance variables
    provider->joinPMtree(this);					// add us to the power management tree
    if (pm_vars != NULL)
    {
        
        // register ourselves with ourself as policy-maker
        
        registerPowerDriver(this, gOurPowerStates, kNumCDCStates);
        return true;
    } else {
        XTRACE(this, 0, 0, "initForPM - Initializing power manager failed");
    }
    
    return false;
    
}/* end initForPM */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::initialPowerStateForDomainState
//
//		Inputs:		flags - 
//
//		Outputs:	return code - Current power state
//
//		Desc:		Request for our initial power state. 
//
/****************************************************************************************************/

unsigned long MSP430LPCDC::initialPowerStateForDomainState(IOPMPowerFlags flags)
{
    
    XTRACE(this, 0, flags, "initialPowerStateForDomainState");
    
    return fPowerState;
    
}/* end initialPowerStateForDomainState */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDC::setPowerState
//
//		Inputs:		powerStateOrdinal - on/off
//
//		Outputs:	return code - IOPMNoErr, IOPMAckImplied or IOPMNoSuchState
//
//		Desc:		Request to turn device on or off. 
//
/****************************************************************************************************/

IOReturn MSP430LPCDC::setPowerState(unsigned long powerStateOrdinal, IOService *whatDevice)
{
    
    XTRACE(this, 0, powerStateOrdinal, "setPowerState");
	
	if (powerStateOrdinal != fPowerState)
	{
		fPowerState = powerStateOrdinal;
		switch (fPowerState)
		{
			case kCDCPowerOffState:
				
                // Warn our data driver and clean up any threads, if we can
				
				if (fDataDriver)
				{
					XTRACE(this, 0, fDataDriver->fThreadSleepCount, "setPowerState - Warning data driver");
					
					fDataDriver->fTerminate = true;
                    fDataDriver->clearSleepingThreads();
				}
				
				break;
				
			case kCDCPowerOnState:
				
                // See if we need to reset or reenumerate this device
				
				resetDevice();
				
				break;
                
			default:
				return IOPMNoSuchState;
		}
	}
	
	return IOPMAckImplied;
    
}/* end setPowerState */


/****************************************************************************************************/
//
//		Method:		MSP430LPCDCUserClient::start
//
//		Inputs:		provider - my provider
//
//		Outputs:	return code - true(it worked), false (it didn't)
//
//		Desc:		Start the user client task. 
//
/****************************************************************************************************/

bool MSP430LPCDCUserClient::start(IOService *provider)
{

    XTRACE(this, 0, 0, "start");
    
    if (super::start(provider) == false)
    {
        XTRACE(this, 0, 0, "start - Provider start failed");
        return false;
    }
    
    fProvider = OSDynamicCast(MSP430LPCDC, provider);
    if (!fProvider)
    {
        XTRACE(this, 0, 0, "start - Provider invalid");
		return false;
    }
    
