robertinant/msp430lpcdc/Classes/MSP430LPCDC.cpp
        // Initialize the call structure
    
    fMethods[0].object = this;
    fMethods[0].func   = (IOMethod)&MSP430LPCDCUserClient::doRequest;
    fMethods[0].count0 = 0xFFFFFFFF;			/* One input  as big as I need */
    fMethods[0].count1 = 0xFFFFFFFF;			/* One output as big as I need */
    fMethods[0].flags  = kIOUCStructIStructO;
    
    return true;
    
}/* end start */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDCUserClient::clientClose
//
//		Inputs:		
//
//		Outputs:	return code - kIOReturnSuccess
//
//		Desc:		Close things down. 
//
/****************************************************************************************************/

IOReturn MSP430LPCDCUserClient::clientClose()
{
    
    XTRACE(this, 0, 0, "clientClose");
    
    if (!fProvider)
    {
        XTRACE(this, 0, 0, "clientClose - Not attached");
        return kIOReturnNotAttached;
    }

        // Make sure it's open before we close it.
    
    if (fProvider->isOpen(this))
        fProvider->close(this);

    fTask = NULL;
    fProvider = NULL;
           
    return kIOReturnSuccess;
    
}/* end clientClose */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDCUserClient::clientDied
//
//		Inputs:		
//
//		Outputs:	return code - kIOReturnSuccess
//
//		Desc:		Close it down now. 
//
/****************************************************************************************************/

IOReturn MSP430LPCDCUserClient::clientDied()
{

    XTRACE(this, 0, 0, "clientDied");
    
    return clientClose();
    
}/* end clientDied */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDCUserClient::doRequest
//
//		Inputs:		pIn - the input buffer
//					pOut - the output buffer
//					inputSize - Size of input buffer
//					pOutPutSize - Size of output buffer
//
//		Outputs:	pOutSize - Number of bytes returned
//					return code - kIOReturnSuccess or kIOReturnBadArgument
//
//		Desc:		Execute the client request. 
//
/****************************************************************************************************/

IOReturn MSP430LPCDCUserClient::doRequest(void *pIn, void *pOut, IOByteCount inputSize, IOByteCount *pOutPutSize)
{
    UInt8	*input;
    
    XTRACE(this, 0, 0, "doRequest");
    
        // Make sure we actually have a provider
        
    if (!fProvider)
    {
        XTRACE(this, 0, 0, "doRequest - Not attached");
        return kIOReturnNotAttached;
    }

	// check first byte of input data for a command code
        
    if (pIn && (inputSize > 0))
    {
        input = (UInt8 *)pIn;
 
            // 1st byte of input has request ID
            
        switch (*input) 
        {
            case cmdACMData_Message:
                return ACMDataMessage(pIn, pOut, inputSize, pOutPutSize);
                		    
            default:
               XTRACE(this, 0, *input, "doRequest - Invalid command");
               break;    
        }
    } else {
        XTRACE(this, 0, inputSize, "doRequest - pIn/pOut or size error");
    }

    return kIOReturnBadArgument;
    
}/* end doRequest */

/****************************************************************************************************/
//
//		Method:		MSP430LPCDCUserClient::ACMDataMessage
//
//		Inputs:		pIn - the input structure
//					pOut - the output structure
//					inputSize - Size of the input structure
//					pOutSize - Size of the output structure
//
//		Outputs:	return code - kIOReturnSuccess
//
//		Desc:		Process the message 
//
/****************************************************************************************************/

IOReturn MSP430LPCDCUserClient::ACMDataMessage(void *pIn, void *pOut, IOByteCount inputSize, IOByteCount *pOutPutSize)
{
	dataParms	*input = (dataParms *)pIn;
    statusData	*output = (statusData *)pOut;
    
    XTRACE(this, 0, 0, "ACMDataMessage");
    
	switch (input->message)
    {
		case noWarning:
			XTRACE(this, 0, 0, "ACMDataMessage - noWarning");
			if ((input->vendor == fProvider->fVendorID) && (input->product == fProvider->fProductID))
			{
				XTRACE(this, fProvider->fVendorID, fProvider->fProductID, "ACMDataMessage - Unplug warning dialog is being suppressed");
				fProvider->fSuppressWarning = true;
				output->status = kSuccess;
			} else {
				XTRACE(this, 0, 0, "ACMDataMessage - noWarning, not my device");
				output->status = kError;
			}
			break;
		case warning:
			XTRACE(this, 0, 0, "ACMDataMessage - warning");
			if ((input->vendor == fProvider->fVendorID) && (input->product == fProvider->fProductID))
			{
				XTRACE(this, fProvider->fVendorID, fProvider->fProductID, "ACMDataMessage - Unplug warning dialog is being re-instated");
				fProvider->fSuppressWarning = false;
				output->status = kSuccess;
			} else {
				XTRACE(this, 0, 0, "ACMDataMessage - warning, not my device");
				output->status = kError;
			}
			break;
		default:
			XTRACE(this, 0, 0, "ACMDataMessage - Invalid message");
			output->status = kError;
			break;
	}

    return kIOReturnSuccess;
    
}/* end ACMDataMessage */